In [7]:
# Welcome to Learning Pandas
# This script will include challenges designed to improve your skills in slicing and filtering data using Pandas.

# Let's start by importing the pandas library
import pandas as pd

# Sample dataset to get us started
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Score': [85, 90, 78, 88, 95]
}

# Create a DataFrame
df = pd.DataFrame(data)
df

      Name  Age         City  Score
0    Alice   24     New York     85
1      Bob   27  Los Angeles     90
2  Charlie   22      Chicago     78
3    David   32      Houston     88
4      Eva   29      Phoenix     95

In [8]:
# First Challenge: Display rows where 'Age' is greater than 25
df.loc[df['Age'] > 25]

    Name  Age         City  Score
1    Bob   27  Los Angeles     90
3  David   32      Houston     88
4    Eva   29      Phoenix     95

In [9]:
df[df['Age']>25]

    Name  Age         City  Score
1    Bob   27  Los Angeles     90
3  David   32      Houston     88
4    Eva   29      Phoenix     95

In [14]:
# Second Challenge: Display only the 'Name' and 'City' columns for rows where 'Score' is greater than 80
df[df['Score'] > 80][['Name', 'City']]

    Name         City
0  Alice     New York
1    Bob  Los Angeles
3  David      Houston
4    Eva      Phoenix

In [18]:
# Third Challenge: Display rows where 'City' is either 'Chicago' or 'Houston'
df[df['City'].isin(['Chicago', 'Houston'])]

      Name  Age     City  Score
2  Charlie   22  Chicago     78
3    David   32  Houston     88

In [24]:
# Challenge 1: Filter Rows by Multiple Conditions
#Find rows where:
# •	The Age is less than 30 and
# •	The Score is greater than 85.

df[df['Age'] < 30] and df[df['Score'] > 85]

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().